
* Testfiles:
All test files do have the same header line:
: * description  :tags:

... followed by 19044 entries with the format:

Testfile 1: «no_drawer»
: ** <2011-12-31 Sat 10:49:52> [[mailto:Karl.Voit@example.com][Karl Voit]]: Re: Hoffe die mail kommt an

Testfile 2: «selfdefined_drawer»
: ** <2011-12-31 Sat 10:49:52> [[mailto:Karl.Voit@example.com][Karl Voit]]: Re: Hoffe die mail kommt an
:   :MEMACSDRAWER:
:   :TO:         Armin Wieser <armin.wieser@example.com>
:   :ID:         <2011-12-31T10-49-17@example.com>
:   :END:

Testfile 3: «properties_drawer»
: ** <2011-12-31 Sat 10:49:52> [[mailto:Karl.Voit@example.com][Karl Voit]]: Re: Hoffe die mail kommt an
:   :PROPERTIES:
:   :TO:         Armin Wieser <armin.wieser@example.com>
:   :ID:         <2011-12-31T10-49-17@example.com>
:   :END:

* Testcases:

- open open file in Emacs with org-mode
- expand1 expand all ~19050 entries
- collapse collapse all ~19050 entries 
- expand2 second expand (after expand + collapse)

Time is measured three times (by hand) in seconds:

|--------------------+----------+-------+-------+-------+-------+----------------------------------------------------|
| Testfile           | Testcase | time1 | time2 | time3 |  mean | comment                                            |
|--------------------+----------+-------+-------+-------+-------+----------------------------------------------------|
| no_drawer          | open     |     1 |     1 |     1 |   1.0 | *ok*                                               |
| no_drawer          | expand1  |     1 |     1 |     1 |   1.0 | *ok*                                               |
| no_drawer          | collapse |     1 |     1 |     1 |   1.0 | *ok*                                               |
| no_drawer          | expand2  |     1 |     1 |     1 |   1.0 | *ok*                                               |
| selfdefined_drawer | open     |     1 |     1 |     1 |   1.0 | very fast although a drawer exists                 |
| selfdefined_drawer | expand1  |    70 |    90 |    80 |  80.0 | better than «propreties_drawer» but still not fast |
| selfdefined_drawer | collapse |     1 |     1 |     1 |   1.0 | ok                                                 |
| selfdefined_drawer | expand2  |    70 |    80 |    80 |  76.7 | nearly same as «propreties_drawer»                 |
| properties_drawer  | open     |   190 |   166 |   205 | 187.0 | *slow*                                             |
| properties_drawer  | expand1  |   400 |   430 |   450 | 426.7 | *slow*                                             |
| properties_drawer  | collapse |     1 |     1 |     1 |   1.0 | ok                                                 |
| properties_drawer  | expand2  |    70 |    90 |    85 |  81.7 | *slow*                                             |
#+TBLFM: $6=($3+$4+$5)/3;%.1f

* Conclusion

- Best performance: only without any drawers at all
- Acceptable performance when using another drawer than :PROPERTIES:
- Worst performance when using :PROPERTIES: drawer

* Test Machine

- Lenovo X301
- Samsung [[http://en.wikipedia.org/wiki/Ssd][SSD]]
- 4GB Ram 
- CPU Intel(R) Core(TM)2 Duo CPU U9400 @1.40GHz
- GNU/Linux: [[http://en.wikipedia.org/wiki/Ubuntu_11.10#Ubuntu_11.10_.28Oneiric_Ocelot.29][Ubuntu 11.10 oneiric]]
- Org-mode version 7.8.02
- GNU Emacs 23.3.1 (x86_64-pc-linux-gnu, X toolkit, Xaw3d scroll bars)
  - of 2011-08-14 on allspice
  - modified by Debian
- *some programs are running in parallel* - will make *no huge* difference
